{
    "abstract": "A successful class of image denoising methods is based on Bayesian approaches working in\nwavelet representations. The performance of these methods improves when relations among the local frequency coefficients are explicitly included. However, in these techniques, analytical\nestimates can be obtained <i>only</i> for particular combinations of analytical models\nof signal and noise, thus precluding its straightforward extension to deal with other arbitrary noise sources.\n\n<br>\n\nIn this paper,\nwe propose an alternative non-explicit way to take into account the relations\namong natural image wavelet coefficients for denoising: we use support vector regression\n(SVR) in the wavelet domain to enforce these relations in the estimated signal.\nSince relations\namong the coefficients are specific to the signal, the\nregularization property of SVR is exploited to remove the noise, which does not\nshare this feature. The specific signal relations\nare encoded in an anisotropic kernel obtained from mutual information measures computed on a\nrepresentative image database. In the proposed scheme,\ntraining considers minimizing the Kullback-Leibler divergence (KLD) between the estimated\nand actual probability functions (or histograms) of signal and noise in order\nto enforce similarity up to the higher (computationally estimable) order.\nDue to its non-parametric nature, the method can eventually cope\nwith different noise sources without the need of an explicit re-formulation, as it is\nstrictly necessary under parametric Bayesian formalisms.\n\n<br>\n\nResults under several noise levels and noise sources show that:\n(1) the proposed method outperforms conventional wavelet\nmethods that assume coefficient independence, (2) it is similar to state-of-the-art methods\nthat do explicitly include these relations when the noise source is Gaussian, and (3)\nit gives better numerical and visual performance when more complex, realistic\nnoise sources are considered. Therefore, the\nproposed machine learning approach can be seen as a more\nflexible (model-free) alternative to the explicit description\nof wavelet coefficient relations for image denoising.",
    "authors": [
        "Valero Laparra",
        "Juan Guti{{\\'e}}rrez",
        "Gustavo Camps-Valls",
        "Jes&#250;s Malo"
    ],
    "id": "laparra10a",
    "issue": 29,
    "pages": [
        873,
        903
    ],
    "title": "Image Denoising with Kernels Based on Natural Image Relations",
    "volume": "11",
    "year": "2010"
}